[
  {
  
  },
  {
    "id": 14,
    "title": "Edge Server Platform",
    "description": "This data center consists of 19 server racks in so that data processing can happen closer to its source to reduce latency and improve efficiency. The data processing that can happen at the data center, located in Downtown Detroit, includes creating digital mapping using multiple data sources to assist drone operators in understanding ground and airspace risks in real-time.",
    "keyFeatures": "- 19 server racks processing data locally to reduce delays\n- Creates real-time digital maps from multiple data source",
    "lat": null,
    "lng": null,
    "color": "#3498DB",
    "image": "public/marker-images/Edge-Server.jpg",
    "height": 0
  },
  {
    "id": 22,
    "title": "Advanced Aerial Innovation Region (AAIR)",
    "description": "A first-of-its-kind urban drone testing zone where companies can safely fly and test drones in a busy city environment. Michigan Central partnered with the State of Michigan to create this area, which spans a 3-mile radius surrounding The Station. It's equipped with data, operations, and digital mapping systems supported by Airspace Link. Working directly with the Federal Aviation Administration, they help members and partners get the guidance they need to safely test, monitor, and accelerate development of drones and uncrewed aircraft systems under 55 pounds, all in a real urban setting.",
    "keyFeatures": "- 3-mile radius testing zone around The Station\n- Federal Aviation Administration partnership\n- For drones under 55 pounds and commercial aircraft",
    "lat": 42.3283,
    "lng": -83.0767,
    "color": "#27AE60",
    "image": "public/marker-images/AdvanceAerialInnovation.png",
    "height": 25
  },
  {
    "id": 33,
    "title": "Transportation Innovation Zone",
    "description": "A special four-square-mile area in Detroit where companies can test solutions. Created in partnership with the City of Detroit, the Transportation Innovation Zone creates a pathway between mobility innovation and regulatory compliance, cutting the permitting process from months to weeks, letting companies efficiently pilot their solutions in a real-world environment.",
    "keyFeatures": "- 4 square miles with City of Detroit partnership\n- Fast-tracked permitting cuts approval from months to weeks",
    "lat": 42.329,
    "lng": -83.0771,
    "color": "#9B59B6",
    "image": "public/marker-images/TransportationInnovationZone.png",
    "height": 25
  },
  {
    "id": 1,
    "title": "The Station",
    "description": "This beautifully restored, historic 18-story train station is now the heart of the Michigan Central innovation hub. After Ford's six-year restoration, this once-abandoned Detroit landmark now holds innovation studios, flexible workspace for established and growing companies, convening areas, community programs, and hospitality. From Ford teams working on electric vehicles and software-driven services to computer science education for students, The Station is where the next generation of innovation happens.",
    "keyFeatures": "- 18-story historic train station restored over 6 years by Ford\n- Houses Ford teams and Google Code Next program\n- 23,000 sq ft of youth programming space",
    "lat": 42.32680332,
    "lng": -83.07748321,
    "color": "#4A90E2",
    "image": "public/marker-images/1.png",
    "height": 40
  },
  {
    "id": 2,
    "title": "Newlab",
    "description": "A massive 270,000-square-foot workspace where over 150 startups are building the future of mobility. Think of it as a giant garage where brilliant minds work on everything from drones to electric vehicles to robotics, complete with state-of-the-art labs and manufacturing space, with Michigan Central and Newlab supporting startups with ongoing resources for every stage of their journey.",
    "keyFeatures": "- 270,000 sq ft of workspace with nearly 2,000 people across 200+ startups\n- 47% have founders from underrepresented backgrounds, 40% from outside Michigan\n- Includes prototyping labs, manufacturing shops, offices, and event spaces",
    "lat": 42.32592547,
    "lng": -83.07443415,
    "color": "#4A90E2",
    "image": "public/marker-images/Newlab-at-MC.jpg",
    "height": 30
  },
  {
    "id": 3,
    "title": "The Factory",
    "description": "Workspace for Ford's Ford Pro teams that provide vehicles, charging solutions, financing, and software services to Ford's commercial customers around the world. Once home to the Chicago Hosiery and Detroit-Alaska Knitting Mills factories, this building is another example of old industrial spaces transformed for modern innovation.",
    "keyFeatures": "- Ford Pro headquarters since 2017 in former knitting mills building\n- Home to Ford's commercial vehicle and government customer teams",
    "lat": 42.33059257,
    "lng": -83.07229005,
    "color": "#4A90E2",
    "image": "public/marker-images/Factory.jpg",
    "height": 30
  },
  {
    "id": 4,
    "title": "Digital Fabrication Shop",
    "description": "Where digital sketches and plans become reality using large-scale industrial 3D printers, precision laser cutters, and a robotic arm extruder that builds 3D objects layer by layer. Perfect for creating prototypes quickly, testing new product designs, and bringing digital concepts into the physical world.",
    "keyFeatures": "- 3 large-scale 3D printers, 3 laser cutters, 5-axis robot arm extruder\n- Latest Bambu Lab and FormLabs equipment plus metal printing\n- Large format printer and vinyl cutter",
    "lat": 42.32839326,
    "lng": -83.07705378,
    "color": "#E74C3C",
    "image": "public/marker-images/Digital-Fabrication-Shop.jpg",
    "height": 20
  },
  {
    "id": 5,
    "title": "Wood Shop",
    "description": "Traditional woodworking meets modern technology. This fully-equipped shop features both computer-controlled CNC routers and classic hand tools, including precision saws, bandsaws, a lathe, planer, and jointer. Great for building prototypes, parts, and products.",
    "keyFeatures": "- 2 CNC routers plus traditional tools (table saw, bandsaws, lathe)\n- Both digital and hand tool woodworking capabilities\n- Complete planer, jointer, and Festool hand tool collection",
    "lat": 42.32795938,
    "lng": -83.07593233,
    "color": "#E74C3C",
    "image": "public/marker-images/woodshop.png",
    "height": 20
  },
  {
    "id": 6,
    "title": "Metal Shop",
    "description": "The place to cut, shape, and weld metal parts, this shop features a precision fiber laser for cutting, professional welders for joining metal components, a press brake for bending, bandsaws for rough cuts, and specialized tools for rolling tubes and shearing metal sheets. Essential for building anything from vehicle parts to drone frames with professional-grade results.",
    "keyFeatures": "- CNC fiber laser, 2 MIG welders, 1 TIG welder\n- Press brake, bandsaws, shear, tube roller\n- Complete metalworking and welding technology",
    "lat": 42.32815463,
    "lng": -83.07645834,
    "color": "#E74C3C",
    "image": "public/marker-images/Metal-Shop.jpg",
    "height": 20
  },
  {
    "id": 7,
    "title": "Electronics Lab",
    "description": "Where electronic parts are built and tested. This lab has equipment for creating circuit boards, testing how devices handle electricity, welding battery components, checking for overheating with thermal cameras, and assembling electronic parts with professional soldering stations.",
    "keyFeatures": "- LPKF laser for circuit boards, spectrum analyzers, battery welder\n- Thermal cameras and professional soldering stations",
    "lat": 42.32774007,
    "lng": -83.07683575,
    "color": "#E74C3C",
    "image": "public/marker-images/Electronic-Lab.jpg",
    "height": 20
  },
  {
    "id": 8,
    "title": "Machine Shop",
    "description": "Professional-grade machines that can create precise parts for products. This shop features advanced CNC mills and lathes from industry leaders like Haas and Trak, including a 5-axis mill that can cut complex shapes from multiple angles, precision lathes for round parts, and specialized milling machines for everything from prototypes to production-ready components.",
    "keyFeatures": "- 5-axis Haas mill, multiple CNC lathes and mills\n- Trak precision equipment and Flexarm tapping arm\n- Professional-grade reductive manufacturing capabilities",
    "lat": 42.32815463,
    "lng": -83.07645834,
    "color": "#E74C3C",
    "image": "public/marker-images/machineshop.png",
    "height": 20
  },
  {
    "id": 9,
    "title": "Physical Metrology Shop",
    "description": "Shop for product measurement with a coordinate measuring arm and height gauges for exact dimensions, a 3D scanner that captures precise digital models of physical parts, a universal testing machine that checks material strength, and additional specialized tools to verify that every component meets specifications.",
    "keyFeatures": "- Hexagon coordinate measuring arm, 3D scanner\n- Universal testing machine and precision height gauges",
    "lat": 42.32815463,
    "lng": -83.07645834,
    "color": "#E74C3C",
    "image": "public/marker-images/Physical-Metrology-Shop.webp",
    "height": 20
  },
  {
    "id": 10,
    "title": "Casting and Finishing Shop",
    "description": "The final stop where products get their finishing touches, this shop features a walk-in spray booth for professional painting and powder coating, plus a dedicated casting room for molding work. You'll find an injection molding machine for creating plastic components, ovens for curing and baking on durable coatings, a vacuum former for shaping plastic, specialized chambers for removing air bubbles, parts tumblers for smoothing surfaces, and all the hand tools needed to get products ready for market.",
    "keyFeatures": "- Walk-in spray booth for painting and powder coating\n- Curing ovens, vacuum chamber, parts tumblers for professional finishing",
    "lat": 42.32815463,
    "lng": -83.07645834,
    "color": "#E74C3C",
    "image": "public/marker-images/Casting-and-Finishing-Shop.jpg",
    "height": 20
  },
  {
    "id": 11,
    "title": "Manufacturing Space",
    "description": "A large 10,000-square-foot space for building small batches of products before full-scale manufacturing. This is where teams build prototype units 2-10 of their products and establish production flows. It features five fully-equipped assembly bays that teams can rent, plus advanced machinery including robotic wheel building, laser tube cutting, and robotic welding equipment. It's designed for creating larger products like e-bikes, motorcycles, drones, mobile robots, and EV chargers, helping companies perfect their manufacturing process before transitioning to larger batch production.",
    "keyFeatures": "- 10,000 sq ft with five rentable, fully-tooled assembly bays\n- Robotic wheel building, laser tube cutting, robotic welding",
    "lat": 42.32815463,
    "lng": -83.07645834,
    "color": "#E74C3C",
    "image": "public/marker-images/Manufacturing-Space.png",
    "height": 20
  },
  {
    "id": 12,
    "title": "Grounded's Manufacturing Space",
    "description": "After operating at Newlab at Michigan Central since 2023, Grounded, a company creating fully customizable smart electric RVs and work vans, has expanded their operations into 13,000 square feet of Michigan Central facilities on St. Anne Street. Grounded's expansion exemplifies the opportunities that the area's abundant industrial-zoned real estate provides to grow product development and manufacturing in Detroit.",
    "keyFeatures": "",
    "lat": 42.3265207,
    "lng": -83.08171254,
    "color": "#000000",
    "image": "public/marker-images/Grounded-Manufacturing-Space.png",
    "height": 30
  },
  {
    "id": 13,
    "title": "The 23rd Newlab Manufacturing Space",
    "description": "Newlab is now occupying space adjacent to Michigan Central's 30 acres for founders in the ecosystem to scale operations. With flexible lease footprints starting at 500 square feet and industrial infrastructure including cranes, reinforced floors, truck docks, and rail access, The 23rd gives startups the space, tools, and supply chain access needed to grow product development and manufacturing.",
    "keyFeatures": "",
    "lat": 42.3282866,
    "lng": -83.07663895,
    "color": "#F39C12",
    "image": "public/marker-images/23.png",
    "height": 25
  },
  {
   
  },
  {
    "id": 15,
    "title": "Port of Monroe",
    "description": "A unique testing ground for supply chain innovation 35 miles from Michigan Central. As the country's first state-owned container port and Michigan's only port on Lake Erie, the Port of Monroe offers an unprecedented opportunity to test freight and logistics solutions where water, rail, and road transportation converge. Through a partnership with Newlab and the State of Michigan, companies can pilot everything from autonomous boats to battery-powered rail cars in a real working port environment.",
    "keyFeatures": "- Country's first state-owned container port, 35 miles away\n- Access to Lake Erie, Detroit River, and Atlantic Ocean",
    "lat": 41.9165,
    "lng": -83.3982,
    "color": "#43825A",
    "image": "public/marker-images/Port-of-Monroe.png",
    "height": 25
  },
  {
    "id": 16,
    "title": "Bagley Mobility Hub",
    "description": "A modern mobility center with 1,200 parking spots that is also a testing ground for electric vehicles and transportation solutions. This facility features multiple levels of EV charging, autonomous vehicle testing areas, and e-bike/e-scooter stations where companies can test new technologies with real users. It also serves the community with outdoor plazas, the Michigan Central Info Center, and access to the Southwest Greenway.",
    "keyFeatures": "- 1,200 parking spots with Level-2 and Level-3 chargers\n- Open-source data access for EV trend analysis",
    "lat": 42.32569816,
    "lng": -83.07261709,
    "color": "#000000",
    "image": "public/marker-images/Bagleymobilityhub.JPG",
    "height": 30
  },
  {
    "id": 17,
    "title": "America's First Electrified Road",
    "description": "The nation's first public road that can charge electric vehicles while they drive using wireless technology built into the pavement. In addition to the road - built in partnership with the state of Michigan, City of Detroit, and wireless charging company Electreon -- they also have parking spots nearby that charge cars wirelessly, no plugging in required.",
    "keyFeatures": "- Built with Michigan DOT and Electreon technology\n- 2 nearby parking spots with wireless charging",
    "lat": 42.32992106,
    "lng": -83.07508549,
    "color": "#9B59B6",
    "image": "public/marker-images/America_s-First-Electrified-Road.jpg",
    "height": 25
  },
  {
    "id": 18,
    "title": "Aerial Ops Center",
    "description": "Mission control for drone testing, located on the 12th floor of The Station. This aerial operations center features multi-screen monitoring walls, 360-degree visual line of sight of the surrounding area, flexible command centers, and collaboration spaces that multiple companies can share simultaneously for safe, coordinated drone testing operations.",
    "keyFeatures": "- 12th floor of The Station with 360-degree visual coverage\n- Large multi-screen video wall and 2 command centers",
    "lat": 42.32738629,
    "lng": -83.0783868,
    "color": "#9B59B6",
    "image": "public/marker-images/Aerial-Ops.jpg",
    "height": 25
  },
  {
    "id": 19,
    "title": "Scaled Launch Facility",
    "description": "A half-acre outdoor testing ground next to The Station for drone operations and other technology testing. This flexible space offers rentable areas with industrial power, fiber internet, and adaptable infrastructure, all coordinated with the 12th-floor operations center for safe, controlled testing of aerial mobility and other innovations.",
    "keyFeatures": "- Half-acre outdoor space with up to 480-volt power\n- Fiber internet and adaptable power tray system",
    "lat": 42.32872407,
    "lng": -83.0833833,
    "color": "#000000",
    "image": "public/marker-images/Scaled-launch-facility.jpeg",
    "height": 25
  },
  {
    "id": 20,
    "title": "The Launchpad",
    "description": "A 900-square-foot rooftop drone launch platform where multiple companies can safely take off and land their drones. This shared-access launchpad sits at the heart of the innovation ecosystem and enables testing of small drones doing everything from food and medication delivery to building inspections.",
    "keyFeatures": "- 900-sq-ft rooftop drone launch platform on Newlab\n- Fully integrated with AAIR control systems",
    "lat": 42.3282884,
    "lng": -83.07674166,
    "color": "#27AE60",
    "image": "public/marker-images/Launchpad.JPG",
    "height": 25
  },
  {
    "id": 21,
    "title": "Beyond Visual Line of Sight Systems",
    "description": "This system provides operators with digital eyes in the sky and monitoring of low-altitude airspace, allowing for real-time aircraft detection and monitoring as well as command and control of unmanned flights. By removing the need for operators to directly see the drone at all times, these operations unlock the ability for drones to operate at longer distances and over larger areas. This enables more efficient, scalable drone use that can help companies move from small tests to commercial deployment.",
    "keyFeatures": "- 2 X-band radar units and 3 networked ADS-B receivers\n- 9 ground radio stations for extended communication",
    "lat": null,
    "lng": null,
    "color": "#27AE60",
    "image": "public/marker-images/BeyondVisualLineofSightSystems.png",
    "height": 0
  },
  {
    "id": 23,
    "title": "Smart Light Posts",
    "description": "Smart street lights throughout the campus equipped with power and internet connections that companies can use to test urban technologies. Teams can install sensors and other equipment on the posts, as well, in order to conduct more tailored pilots that help them improve their new technologies and solutions.",
    "keyFeatures": "- Throughout 30 acres with built-in power and data connectivity\n- Ready-made infrastructure for smart city technology pilots",
    "lat": 42.32462487,
    "lng": -83.07056665,
    "color": "#5DADE2",
    "image": "public/marker-images/light-post.jpeg",
    "height": 25
  },
  {
    "id": 24,
    "title": "Urban Location",
    "description": "A city location in the heart of Detroit surrounded by neighborhoods, retail, restaurants, and parks provides a testing environment with real community, traffic, and urban challenges that companies need to solve.",
    "keyFeatures": "",
    "lat": 42.32698034,
    "lng": -83.06953792,
    "color": "#4C7B3B",
    "image": "public/marker-images/Urban-Location.png",
    "height": 25
  },
  {
    "id": 25,
    "title": "Railroad",
    "description": "Direct access to freight rail lines opens up possibilities for developing and testing ways to improve how goods move by train and how multimodal supply chains can be improved.",
    "keyFeatures": "",
    "lat": 42.32787627,
    "lng": -83.08108979,
    "color": "#4C7B3B",
    "image": "public/marker-images/Railroad.png",
    "height": 25
  },
  {
    "id": 26,
    "title": "Detroit River",
    "description": "Proximity to the Detroit River and Great Lakes provides access to testing maritime technologies and water-based transportation.",
    "keyFeatures": "",
    "lat": 42.31504917,
    "lng": -83.06937804,
    "color": "#4C7B3B",
    "image": "public/marker-images/River.jpg",
    "height": 25
  },
  {
    "id": 27,
    "title": "US-Canada Border",
    "description": "A location just minutes from the Canadian border can offer unique opportunities for international logistics solutions and connects Detroit innovation to global markets.",
    "keyFeatures": "",
    "lat": 42.31799036,
    "lng": -83.06296521,
    "color": "#4C7B3B",
    "image": "public/marker-images/Canada-border.png",
    "height": 25
  },
  {
    "id": 28,
    "title": "Roosevelt Park",
    "description": "A City of Detroit Park, Roosevelt Park serves as the front lawn of The Station. The City of Detroit renovated the park in 2023 based on community input, creating a unified space by rerouting Vernor Highway and restoring this historic gathering place.",
    "keyFeatures": "",
    "lat": 42.33041304580484,
    "lng": -83.07701171539,
    "color": "#4C7B3B",
    "image": "public/marker-images/Roosevelt-Park.JPG",
    "height": 25
  },
  {
    "id": 29,
    "title": "Marker 29",
    "description": "",
    "keyFeatures": "",
    "lat": 42.33016061,
    "lng": -83.08033878,
    "color": "#4A90E2",
    "image": "public/marker-images/29.png",
    "height": 25
  },
  {
    "id": 30,
    "title": "Marker 30",
    "description": "",
    "keyFeatures": "",
    "lat": 42.33191445,
    "lng": -83.07478441,
    "color": "#4A90E2",
    "image": "public/marker-images/30.png",
    "height": 25
  },
  {
    "id": 31,
    "title": "Marker 31",
    "description": "",
    "keyFeatures": "",
    "lat": 42.3301765,
    "lng": -83.07308088,
    "color": "#4A90E2",
    "image": "public/marker-images/31.png",
    "height": 25
  },
  {
    "id": 32,
    "title": "Marker 32",
    "description": "",
    "keyFeatures": "",
    "lat": 42.33030902,
    "lng": -83.07180499,
    "color": "#4A90E2",
    "image": "public/marker-images/32.png",
    "height": 25
  }
]